Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.vm.layoutEnv.layoutNodeNeedsPaneALeafOrDirectionASplit
source: layout node needs 'pane' (a leaf) or 'direction' (a split)
ar: تحتاج عقدة التخطيط إلى 'pane' (ورقة) أو 'direction' (تقسيم)
de: Layout-Knoten benötigt 'pane' (ein Blatt) oder 'direction' (einen Split)
es: el nodo de diseño necesita 'pane' (una hoja) o 'direction' (una división)
fr: le nœud de disposition a besoin de 'pane' (une feuille) ou 'direction' (une division)
ja: レイアウトノードには 'pane' (リーフ) または 'direction' (スプリット) が必要です
ko: 레이아웃 노드에는 'pane'(리프) 또는 'direction'(스플릿)이 필요합니다
zh_hans: 布局节点需要 'pane' (叶节点) 或 'direction' (拆分)
zh_hant: 版面配置節點需要 'pane' (葉節點) 或 'direction' (分割)

# cli.vm.layoutEnv.lineValueExpectedKEYVALUEGotValue
source: line %1$@: expected KEY=VALUE, got '%2$@'
ar: السطر %1$@: متوقع KEY=VALUE، ولكن تم تلقي '%2$@'
de: Zeile %1$@: KEY=VALUE erwartet, '%2$@' erhalten
es: línea %1$@: se esperaba CLAVE=VALOR, se obtuvo '%2$@'
fr: ligne %1$@ : KEY=VALUE attendu, reçu '%2$@'
ja: %1$@ 行目: KEY=VALUE が期待されましたが、'%2$@' が指定されました
ko: %1$@행: KEY=VALUE 형식을 예상했으나 '%2$@'을(를) 받았습니다
zh_hans: 第 %1$@ 行：预期为 KEY=VALUE，但收到 '%2$@'
zh_hant: 第 %1$@ 行：預期為 KEY=VALUE，但取得 '%2$@'

# cli.vm.layoutEnv.lineValueInvalidVariableNameValueKeysMatchAZa
source: line %1$@: invalid variable name '%2$@' (keys match [A-Za-z_][A-Za-z0-9_]*)
ar: السطر %1$@: اسم متغير غير صالح '%2$@' (تطابق المفاتيح [A-Za-z_][A-Za-z0-9_]*)
de: Zeile %1$@: ungültiger Variablenname '%2$@' (Schlüssel entsprechen [A-Za-z_][A-Za-z0-9_]*)
es: línea %1$@: nombre de variable no válido '%2$@' (las claves coinciden con [A-Za-z_][A-Za-z0-9_]*)
fr: ligne %1$@ : nom de variable invalide '%2$@' (les clés correspondent à [A-Za-z_][A-Za-z0-9_]*)
ja: %1$@ 行目: 無効な変数名 '%2$@' です (キーは [A-Za-z_][A-Za-z0-9_]* に一致する必要があります)
ko: %1$@행: 유효하지 않은 변수 이름 '%2$@' (키가 [A-Za-z_][A-Za-z0-9_]*과 일치해야 함)
zh_hans: 第 %1$@ 行：无效的变量名 '%2$@' (键匹配 [A-Za-z_][A-Za-z0-9_]*)
zh_hant: 第 %1$@ 行：無效的變數名稱 '%2$@' (鍵值須符合 [A-Za-z_][A-Za-z0-9_]*)

# cli.vm.layoutEnv.noLayoutFoundExpectedANodePaneOrDirectionLayout
source: no layout found: expected a node ({"pane": …} or {"direction": …}), {"layout": <node>}, or {"workspace": {"layout": <node>}}
ar: لم يتم العثور على تخطيط: متوقع عقدة ({"pane": …} أو {"direction": …})، أو {"layout": <node>}، أو {"workspace": {"layout": <node>}}
de: Kein Layout gefunden: Knoten ({"pane": …} oder {"direction": …}), {"layout": <node>} oder {"workspace": {"layout": <node>}} erwartet
es: no se encontró ningún diseño: se esperaba un nodo ({"pane": …} o {"direction": …}), {"layout": <node>} o {"workspace": {"layout": <node>}}
fr: aucune disposition trouvée : nœud attendu ({"pane": …} ou {"direction": …}), {"layout": <node>}, ou {"workspace": {"layout": <node>}}
ja: レイアウトが見つかりません。ノード ({"pane": …} または {"direction": …})、{"layout": <node>}、または {"workspace": {"layout": <node>}} が必要です
ko: 레이아웃을 찾을 수 없음: 노드({"pane": …} 또는 {"direction": …}), {"layout": <node>} 또는 {"workspace": {"layout": <node>}} 형식이 필요합니다
zh_hans: 未找到布局：应为节点 ({"pane": …} 或 {"direction": …})、{"layout": <node>} 或 {"workspace": {"layout": <node>}}
zh_hant: 找不到版面配置：預期為節點 ({"pane": …} 或 {"direction": …})、{"layout": <node>} 或 {"workspace": {"layout": <node>}}

# cli.vm.layoutEnv.notValidJSON
source: not valid JSON
ar: ليس JSON صالحاً
de: kein gültiges JSON
es: no es un JSON válido
fr: JSON non valide
ja: 有効なJSONではありません
ko: 유효한 JSON이 아닙니다
zh_hans: 无效的 JSON
zh_hant: 非有效 JSON

# cli.vm.layoutEnv.openItCmuxVmWorkspaceOpenValueValue
source: Open it: cmux vm workspace open %1$@ %2$@
ar: افتحه: cmux vm workspace open %1$@ %2$@
de: Öffnen: cmux vm workspace open %1$@ %2$@
es: Ábrelo: cmux vm workspace open %1$@ %2$@
fr: Ouvrez-le : cmux vm workspace open %1$@ %2$@
ja: 開く: cmux vm workspace open %1$@ %2$@
ko: 열기: cmux vm workspace open %1$@ %2$@
zh_hans: 打开它：cmux vm workspace open %1$@ %2$@
zh_hant: 開啟它：cmux vm workspace open %1$@ %2$@

# cli.vm.layoutEnv.paneMustBeAnObject
source: 'pane' must be an object
ar: يجب أن يكون 'pane' كائناً
de: 'pane' muss ein Objekt sein
es: 'pane' debe ser un objeto
fr: 'pane' doit être un objet
ja: 'pane' はオブジェクトである必要があります
ko: 'pane'은 객체여야 합니다
zh_hans: 'pane' 必须是一个对象
zh_hant: 'pane' 必須為物件

# cli.vm.layoutEnv.splitMustBeANumberTheFirstChildSShare
source: 'split' must be a number (the first child's share, 0.1–0.9)
ar: يجب أن يكون 'split' عدداً (حصة العنصر الفرعي الأول، 0.1–0.9)
de: 'split' muss eine Zahl sein (der Anteil des ersten Kind-Elements, 0.1–0.9)
es: 'split' debe ser un número (la proporción del primer hijo, 0.1–0.9)
fr: 'split' doit être un nombre (la part du premier enfant, 0.1–0.9)
ja: 'split' は数値である必要があります (最初の子のシェア、0.1–0.9)
ko: 'split'은 숫자(첫 번째 자식의 점유 비율, 0.1–0.9)여야 합니다
zh_hans: 'split' 必须是一个数字（首个子节点的占比，0.1–0.9）
zh_hant: 'split' 必須為數字 (第一個子項的比例，0.1–0.9)

# cli.vm.layoutEnv.splitNeedsExactly2ChildrenGotValue
source: split needs exactly 2 children (got %1$@)
ar: يتطلب split عنصرين فرعيين بالضبط (تم الحصول على %1$@)
de: split benötigt genau 2 Kind-Elemente (%1$@ erhalten)
es: split necesita exactamente 2 hijos (se obtuvo %1$@)
fr: split requiert exactement 2 enfants (%1$@ reçu)
ja: split にはちょうど2つの子要素が必要です (%1$@ 個を受け取りました)
ko: split에는 정확히 2개의 자식이 필요합니다(받은 값: %1$@)
zh_hans: split 需要恰好 2 个子节点（收到 %1$@）
zh_hant: split 需要剛好 2 個子項 (收到 %1$@)

# cli.vm.layoutEnv.stdinIsNotUTF8Text
source: stdin is not UTF-8 text
ar: stdin ليس نصاً بتنسيق UTF-8
de: stdin ist kein UTF-8-Text
es: stdin no es texto UTF-8
fr: stdin n'est pas du texte UTF-8
ja: 標準入力が UTF-8 テキストではありません
ko: stdin이 UTF-8 텍스트가 아닙니다
zh_hans: stdin 不是 UTF-8 文本
zh_hant: stdin 不是 UTF-8 文字

# cli.vm.layoutEnv.surfaceMustBeAnObject
source: surface must be an object
ar: يجب أن يكون surface كائناً
de: surface muss ein Objekt sein
es: surface debe ser un objeto
fr: surface doit être un objet
ja: surface はオブジェクトである必要があります
ko: surface는 객체여야 합니다
zh_hans: surface 必须是一个对象
zh_hant: surface 必須為物件

# cli.vm.layoutEnv.surfacesMustBeANonEmptyArray
source: 'surfaces' must be a non-empty array
ar: يجب أن تكون 'surfaces' مصفوفة غير فارغة
de: 'surfaces' muss ein nicht-leeres Array sein
es: 'surfaces' debe ser un array no vacío
fr: 'surfaces' doit être un tableau non vide
ja: 'surfaces' は空ではない配列である必要があります
ko: 'surfaces'는 비어 있지 않은 배열이어야 합니다
zh_hans: 'surfaces' 必须是一个非空数组
zh_hant: 'surfaces' 必須為非空陣列

# cli.vm.layoutEnv.thisMachineSCmuxShimPredatesValueSupportReconnectIt
source: this machine's cmux shim predates %1$@ support — reconnect it (cmux vm tree %2$@ --refresh) to heal, then retry
ar: إن cmux shim الخاص بهذا الجهاز يسبق دعم %1$@ — أعد توصيله (cmux vm tree %2$@ --refresh) للإصلاح، ثم أعد المحاولة
de: Der cmux-Shim dieses Rechners ist älter als die Unterstützung für %1$@ — verbinden Sie ihn neu (cmux vm tree %2$@ --refresh), um dies zu beheben, und versuchen Sie es dann erneut
es: el shim cmux de esta máquina es anterior a la compatibilidad con %1$@ — vuelve a conectarlo (cmux vm tree %2$@ --refresh) para repararlo, luego vuelve a intentarlo
fr: le cmux shim de cette machine est antérieur à la prise en charge de %1$@ — reconnectez-le (cmux vm tree %2$@ --refresh) pour le réparer, puis réessayez
ja: このマシンの cmux shim は %1$@ サポートより前のバージョンです — 再接続して修復し (cmux vm tree %2$@ --refresh)、再試行してください
ko: 이 머신의 cmux shim이 %1$@ 지원 이전의 구버전입니다 — 복구하려면 다시 연결(cmux vm tree %2$@ --refresh)한 후 다시 시도하십시오
zh_hans: 此机器的 cmux shim 早于 %1$@ 支持 — 请重新连接（cmux vm tree %2$@ --refresh）以修复，然后重试
zh_hant: 此機器的 cmux shim 早於 %1$@ 支援 — 請重新連線 (cmux vm tree %2$@ --refresh) 以修復，然後重試

# cli.vm.layoutEnv.typeMustBeTerminalBrowserOrProject
source: 'type' must be "terminal", "browser", or "project"
ar: يجب أن يكون 'type' هو "terminal" أو "browser" أو "project"
de: 'type' muss "terminal", "browser" oder "project" sein
es: 'type' debe ser "terminal", "browser" o "project"
fr: 'type' doit être "terminal", "browser" ou "project"
ja: 'type' は "terminal"、"browser"、または "project" である必要があります
ko: 'type'은 "terminal", "browser" 또는 "project"여야 합니다
zh_hans: 'type' 必须是 "terminal"、"browser" 或 "project"
zh_hant: 'type' 必須為 "terminal"、"browser" 或 "project"

# cli.vm.layoutEnv.valueMustBeAString
source: '%1$@' must be a string
ar: يجب أن يكون '%1$@' سلسلة نصية
de: '%1$@' muss eine Zeichenkette sein
es: '%1$@' debe ser una cadena
fr: '%1$@' doit être une chaîne de caractères
ja: '%1$@' は文字列である必要があります
ko: '%1$@'은 문자열이어야 합니다
zh_hans: '%1$@' 必须是一个字符串
zh_hant: '%1$@' 必須為字串

# cli.vm.layoutEnv.valueOfValueMustBeASingleLine
source: value of %1$@ must be a single line
ar: يجب أن تكون قيمة %1$@ سطراً واحداً
de: Wert von %1$@ muss eine einzelne Zeile sein
es: el valor de %1$@ debe ser una sola línea
fr: la valeur de %1$@ doit être une seule ligne
ja: %1$@ の値は単一の行である必要があります
ko: %1$@의 값은 단일 행이어야 합니다
zh_hans: %1$@ 的值必须是单行
zh_hant: %1$@ 的值必須為單一行

# cli.vm.push.secretDelivered
source: OK %1$@ (%ld bytes, mode %3$@) delivered over the link
ar: تم تسليم %1$@ (%ld بايت، الوضع %3$@) عبر الاتصال
de: OK, %1$@ (%ld Bytes, Modus %3$@) über die Verbindung übertragen
es: OK, %1$@ (%ld bytes, modo %3$@) entregado a través de la conexión
fr: OK, %1$@ (%ld octets, mode %3$@) transmis via la connexion
ja: 接続経由で %1$@（%ld バイト、モード %3$@）を送信しました
ko: 연결을 통해 %1$@(%ld바이트, 모드 %3$@) 전송 완료
zh_hans: 已通过连接传送 %1$@（%ld 字节，模式 %3$@）
zh_hant: 已透過連線傳送 %1$@（%ld 位元組，模式 %3$@）

# cli.vm.unsupportedProviderOverride
source: vm: unsupported Cloud VM service override. Omit --provider and retry the same command.
ar: vm: تجاوز خدمة Cloud VM غير مدعوم. احذف --provider وأعد محاولة الأمر نفسه.
de: vm: Nicht unterstützter Cloud-VM-Dienst-Override. Lassen Sie --provider weg und versuchen Sie denselben Befehl erneut.
es: vm: anulación del servicio Cloud VM no admitida. Omita --provider y vuelva a intentar el mismo comando.
fr: vm : surcharge du service Cloud VM non prise en charge. Omettez --provider et réessayez la même commande.
ja: vm: この Cloud VM サービスの指定には対応していません。--provider を省略して同じコマンドを再実行してください。
ko: vm: 지원되지 않는 Cloud VM 서비스 오버라이드입니다. --provider를 제외하고 동일한 명령을 다시 시도하십시오.
zh_hans: vm：不支持的 Cloud VM 服务覆盖。省略 --provider 并重试相同的命令。
zh_hant: vm：不支援的 Cloud VM 服務覆寫。請省略 --provider 並重試相同的指令。

# cloudEnv.error.deliveryCancelled
source: Environment delivery was cancelled.
ar: تم إلغاء تسليم البيئة.
de: Die Bereitstellung der Umgebung wurde abgebrochen.
es: La entrega del entorno se canceló.
fr: La livraison de l'environnement a été annulée.
ja: 環境変数の送信がキャンセルされました。
ko: 환경 전달이 취소되었습니다.
zh_hans: 环境交付已取消。
zh_hant: 環境交付已取消。

# cloudEnv.error.deliveryFailed
source: Environment delivery failed.
ar: فشل تسليم البيئة.
de: Die Bereitstellung der Umgebung ist fehlgeschlagen.
es: La entrega del entorno falló.
fr: La livraison de l'environnement a échoué.
ja: 環境変数の送信に失敗しました。
ko: 환경 전달에 실패했습니다.
zh_hans: 环境交付失败。
zh_hant: 環境交付失敗。

# cloudEnv.error.workspaceCleanupFailed
source: The temporary environment receiver workspace %@ could not be removed. Inspect the machine before retrying.
ar: تعذر إزالة مساحة عمل مستقبِل البيئة المؤقتة %@. افحص الجهاز قبل إعادة المحاولة.
de: Der temporäre Umgebungs-Empfängerarbeitsbereich %@ konnte nicht entfernt werden. Überprüfen Sie die Maschine vor einem erneuten Versuch.
es: El espacio de trabajo temporal receptor del entorno %@ no se pudo eliminar. Inspeccione la máquina antes de volver a intentarlo.
fr: L'espace de travail temporaire de réception de l'environnement %@ n'a pas pu être supprimé. Inspectez la machine avant de réessayer.
ja: 環境変数の受信用に一時作成したワークスペース %@ を削除できませんでした。再試行する前にマシンの状態を確認してください。
ko: 임시 환경 수신기 워크스페이스 %@을(를) 제거할 수 없습니다. 다시 시도하기 전에 머신을 점검하십시오.
zh_hans: 无法删除临时环境接收器工作区 %@。请在重试前检查该机器。
zh_hant: 無法移除臨時環境接收端工作區 %@。請在重試前檢查該機器。

# socket.cloudVM.requestFailed
source: The Cloud VM request failed. Retry, or check the machine's status with `cmux vm ls`.
ar: فشل طلب الآلة الافتراضية السحابية (Cloud VM). أعد المحاولة، أو تحقق من حالة الجهاز باستخدام `cmux vm ls`.
de: Die Cloud-VM-Anfrage ist fehlgeschlagen. Versuchen Sie es erneut oder überprüfen Sie den Status der Maschine mit `cmux vm ls`.
es: La solicitud de la VM Cloud falló. Reintente, o compruebe el estado de la máquina con `cmux vm ls`.
fr: La requête de machine virtuelle Cloud a échoué. Réessayez, ou vérifiez l'état de la machine avec `cmux vm ls`.
ja: Cloud VM のリクエストに失敗しました。再試行するか、`cmux vm ls` でマシンの状態を確認してください。
ko: Cloud VM 요청이 실패했습니다. 다시 시도하거나 `cmux vm ls` 명령으로 머신의 상태를 확인하십시오.
zh_hans: Cloud VM 请求失败。请重试，或使用 `cmux vm ls` 检查机器状态。
zh_hant: Cloud VM 請求失敗。請重試，或使用 `cmux vm ls` 檢查機器狀態。

# socket.cloudVM.transportUnsupported
source: %1$@ offers no `%2$@` transport (its provider has no cmux-tui daemon route), so cmux cannot attach a terminal to it. %3$@
ar: لا يوفر %1$@ وسيلة نقل `%2$@` (ليس لدى المزود الخاص به مسار لبرنامج cmux-tui الخلفي)، لذا لا يمكن لـ cmux ربط طرفية به. %3$@
de: %1$@ bietet keinen `%2$@`-Transport (sein Anbieter hat keine cmux-tui-Daemon-Route), daher kann cmux kein Terminal daran anhängen. %3$@
es: %1$@ no ofrece ningún transporte `%2$@` (su proveedor no tiene una ruta para el demonio cmux-tui), por lo que cmux no puede conectar una terminal al mismo. %3$@
fr: %1$@ n'offre aucun transport `%2$@` (son fournisseur n'a pas de route de démon cmux-tui), cmux ne peut donc pas y attacher de terminal. %3$@
ja: %1$@ には `%2$@` トランスポートがありません（プロバイダーに cmux-tui デーモンへの経路がないため）。そのため cmux はこのマシンにターミナルを接続できません。%3$@
ko: %1$@에서 `%2$@` 전송을 제공하지 않아(해당 프로바이더에 cmux-tui 데몬 경로가 없음) cmux가 이에 터미널을 연결할 수 없습니다. %3$@
zh_hans: %1$@ 未提供 `%2$@` 传输（其服务商没有 cmux-tui 守护进程路由），因此 cmux 无法向其附加终端。%3$@
zh_hant: %1$@ 未提供 `%2$@` 傳輸協定 (其提供商無 cmux-tui 精靈程式路由)，因此 cmux 無法為其附加終端機。%3$@

# socket.cloudVM.transportUnsupported.useExec
source: Use `cmux vm exec %1$@ -- <command>`; `cmux vm ssh %1$@` works where the provider offers SSH.
ar: استخدم `cmux vm exec %1$@ -- <command>`؛ ويعمل `cmux vm ssh %1$@` عندما يوفر المزود خدمة SSH.
de: Verwenden Sie `cmux vm exec %1$@ -- <command>`; `cmux vm ssh %1$@` funktioniert, wenn der Anbieter SSH anbietet.
es: Utilice `cmux vm exec %1$@ -- <command>`; `cmux vm ssh %1$@` funciona si el proveedor ofrece SSH.
fr: Utilisez `cmux vm exec %1$@ -- <command>` ; `cmux vm ssh %1$@` fonctionne là où le fournisseur propose SSH.
ja: `cmux vm exec %1$@ -- <command>` を使用してください。プロバイダーが SSH に対応していれば `cmux vm ssh %1$@` も使えます。
ko: `cmux vm exec %1$@ -- <command>`를 사용하십시오. 프로바이더가 SSH를 제공하는 경우 `cmux vm ssh %1$@`을 사용할 수 있습니다.
zh_hans: 请使用 `cmux vm exec %1$@ -- <command>`；若服务商提供 SSH，则可使用 `cmux vm ssh %1$@`。
zh_hant: 請使用 `cmux vm exec %1$@ -- <command>`；若提供商有提供 SSH，則可使用 `cmux vm ssh %1$@`。

# surfaceCatalog.error.destinationNotFound
source: Destination not found: %@.
ar: تعذر العثور على الوجهة: %@.
de: Ziel nicht gefunden: %@.
es: Destino no encontrado: %@.
fr: Destination introuvable : %@.
ja: 接続先が見つかりません: %@。
ko: 대상을 찾을 수 없습니다: %@.
zh_hans: 未找到目的地：%@。
zh_hant: 找不到目的地：%@。

# surfaceCatalog.error.noProvider
source: This machine is not connected: %@.
ar: هذا الجهاز غير متصل: %@.
de: Diese Maschine ist nicht verbunden: %@.
es: Esta máquina no está conectada: %@.
fr: Cette machine n'est pas connectée : %@.
ja: このマシンは接続されていません: %@。
ko: 이 머신은 연결되어 있지 않습니다: %@.
zh_hans: 该机器未连接：%@。
zh_hant: 此機器未連接：%@。

# surfaceCatalog.error.nothingToOpen
source: Nothing to open: %@.
ar: لا يوجد شيء لفتحه: %@.
de: Nichts zu öffnen: %@.
es: Nada que abrir: %@.
fr: Rien à ouvrir : %@.
ja: 開く対象がありません: %@。
ko: 열 내용이 없습니다: %@.
zh_hans: 没有可打开的内容：%@。
zh_hant: 沒有可開啟的項目：%@。

# surfaceCatalog.error.unavailable
source: %1$@ is unavailable: %2$@
ar: %1$@ غير متوفر: %2$@
de: %1$@ ist nicht verfügbar: %2$@
es: %1$@ no está disponible: %2$@
fr: %1$@ est indisponible : %2$@
ja: %1$@ は利用できません: %2$@
ko: %1$@을(를) 사용할 수 없습니다: %2$@
zh_hans: %1$@ 不可用：%2$@
zh_hant: %1$@ 無法使用：%2$@

# surfaceCatalog.error.unknownResource
source: Unknown surface %@.
ar: واجهة غير معروفة %@.
de: Unbekannte Oberfläche %@.
es: Superficie desconocida %@.
fr: Surface inconnue %@.
ja: サーフェス %@ が見つかりません。
ko: 알 수 없는 서피스 %@.
zh_hans: 未知 surface %@。
zh_hant: 未知的 surface %@。

# surfaceCatalog.error.unsupported
source: Unsupported: %@.
ar: غير مدعوم: %@.
de: Nicht unterstützt: %@.
es: No compatible: %@.
fr: Non pris en charge : %@.
ja: 対応していません: %@。
ko: 지원되지 않습니다: %@.
zh_hans: 不支持：%@。
zh_hant: 不支援：%@。

# sudo.error.pam_tid_unavailable
source: Touch ID for sudo is not configured. Run cmux sudo setup-touch-id.
ar: لم يتم إعداد Touch ID لـ sudo. شغّل cmux sudo setup-touch-id.
bs: Touch ID za sudo nije podešen. Pokrenite cmux sudo setup-touch-id.
da: Touch ID til sudo er ikke konfigureret. Kør cmux sudo setup-touch-id.
de: Touch-ID für sudo ist nicht konfiguriert. Führen Sie cmux sudo setup-touch-id aus.
es: Touch ID para sudo no está configurado. Ejecute cmux sudo setup-touch-id.
fr: Touch ID pour sudo n’est pas configuré. Exécutez cmux sudo setup-touch-id.
it: Touch ID per sudo non è configurato. Esegui cmux sudo setup-touch-id.
ja: sudo 用の Touch ID が設定されていません。cmux sudo setup-touch-id を実行してください。
ko: sudo용 Touch ID가 구성되지 않았습니다. cmux sudo setup-touch-id를 실행하세요.
nb: Touch ID for sudo er ikke konfigurert. Kjør cmux sudo setup-touch-id.
pl: Touch ID dla sudo nie jest skonfigurowany. Uruchom cmux sudo setup-touch-id.
pt_br: O Touch ID do sudo não está configurado. Execute cmux sudo setup-touch-id.
ru: Touch ID для sudo не настроен. Запустите cmux sudo setup-touch-id.
th: Touch ID สำหรับ sudo ยังไม่ได้ตั้งค่า เรียกใช้ cmux sudo setup-touch-id
tr: sudo için Touch ID yapılandırılmamış. cmux sudo setup-touch-id komutunu çalıştırın.
uk: Touch ID для sudo не налаштовано. Запустіть cmux sudo setup-touch-id.
zh_hans: 尚未为 sudo 配置 Touch ID。运行 cmux sudo setup-touch-id。
zh_hant: 尚未為 sudo 設定 Touch ID。執行 cmux sudo setup-touch-id。

# sudo.error.approval_timeout
source: sudo request expired before approval
ar: انتهت صلاحية طلب sudo قبل الموافقة عليه
bs: sudo zahtjev je istekao prije odobrenja
da: sudo-anmodning udløbet før godkendelse
de: Die sudo-Anfrage ist vor der Genehmigung abgelaufen
es: La solicitud sudo expiró antes de la aprobación
fr: La demande sudo a expiré avant l'approbation
it: La richiesta sudo è scaduta prima dell'approvazione
ja: sudo リクエストは承認前に期限切れになりました
ko: sudo 요청이 승인 전에 만료되었습니다.
nb: sudo-forespørsel utløp før godkjenning
pl: Żądanie sudo wygasło przed zatwierdzeniem
pt_br: A solicitação do sudo expirou antes da aprovação
ru: Срок действия запроса sudo истек до утверждения
th: คำขอ sudo หมดอายุก่อนการอนุมัติ
tr: sudo isteğinin süresi onaylanmadan önce doldu
uk: Термін дії запиту sudo закінчився до схвалення
zh_hans: sudo 请求在批准前已过期
zh_hant: sudo 請求在批准前已過期

# sudo.error.requester_unavailable
source: sudo request cancelled because the requesting process exited
ar: تم إلغاء طلب sudo بسبب إنهاء عملية الطلب
bs: sudo Zahtjev je otkazan jer je proces traženja izašao
da: sudo-anmodning annulleret, fordi anmodningen blev afsluttet
de: Die sudo-Anfrage wurde abgebrochen, weil der anfordernde Prozess beendet wurde
es: Solicitud sudo cancelada porque el proceso de solicitud salió
fr: Demande sudo annulée car le processus demandeur s'est terminé
it: sudo richiesta annullata perché il processo di richiesta è terminato
ja: 要求元のプロセスが終了したため、sudo リクエストはキャンセルされました
ko: 요청 프로세스가 종료되어 sudo 요청이 취소되었습니다.
nb: sudo-forespørselen ble kansellert fordi forespørselsprosessen ble avsluttet
pl: Żądanie sudo zostało anulowane, ponieważ proces wysyłania żądania zakończył się
pt_br: A solicitação do sudo foi cancelada porque o processo solicitante foi encerrado
ru: Запрос sudo отменен, поскольку процесс запроса завершился
th: คำขอ sudo ถูกยกเลิกเนื่องจากกระบวนการร้องขอสิ้นสุดลง
tr: sudo istek, istek sürecinden çıkıldığı için iptal edildi
uk: Запит sudo скасовано, оскільки завершився процес запиту
zh_hans: sudo 请求已取消，因为请求进程已退出
zh_hant: sudo 請求已取消，因為請求程序已退出

# sudo.error.execution_interrupted
source: approved sudo execution was interrupted before a result was written
ar: تمت مقاطعة تنفيذ sudo المعتمد قبل كتابة النتيجة
bs: odobreno sudo izvršenje je prekinuto prije nego što je rezultat upisan
da: godkendt sudo-udførelse blev afbrudt, før et resultat blev skrevet
de: genehmigte Sudo-Ausführung wurde unterbrochen, bevor ein Ergebnis geschrieben wurde
es: La ejecución aprobada de sudo se interrumpió antes de que se escribiera el resultado.
fr: l'exécution approuvée de sudo a été interrompue avant qu'un résultat ne soit écrit
it: l'esecuzione approvata di sudo è stata interrotta prima della scrittura di un risultato
ja: 承認された sudo の実行は、結果が書き込まれる前に中断されました
ko: 승인된 sudo 실행은 결과가 기록되기 전에 중단되었습니다.
nb: godkjent sudo utførelse ble avbrutt før et resultat ble skrevet
pl: zatwierdzone wykonanie sudo zostało przerwane przed zapisaniem wyniku
pt_br: A execução aprovada do sudo foi interrompida antes que um resultado fosse gravado
ru: одобренное выполнение sudo было прервано до записи результата
th: การดำเนินการ sudo ที่ได้รับการอนุมัติถูกขัดจังหวะก่อนที่จะเขียนผลลัพธ์
tr: Onaylanan sudo yürütmesi, sonuç yazılmadan önce kesintiye uğradı
uk: затверджене виконання sudo було перервано до запису результату
zh_hans: 批准的 sudo 执行在写入结果之前被中断
zh_hant: 已批准的 sudo 執行在寫入結果之前被中斷

# sudo.error.execution_timeout
source: approved sudo execution timed out; the process tree was terminated
ar: انتهت مهلة تنفيذ sudo المعتمدة؛ تم إنهاء شجرة العملية
bs: odobreno sudo izvršenje je isteklo; stablo procesa je prekinuto
da: godkendt sudo-udførelse fik timeout; procestræet blev opsagt
de: genehmigte Sudo-Ausführung ist abgelaufen; der Prozessbaum wurde beendet
es: se agotó el tiempo de ejecución de sudo aprobado; el árbol de procesos fue terminado
fr: L'exécution approuvée de sudo a expiré ; l'arborescence des processus a été terminée
it: esecuzione approvata di sudo scaduta; l'albero del processo è stato terminato
ja: 承認された sudo の実行がタイムアウトしました。プロセスツリーは終了されました
ko: 승인된 sudo 실행 시간이 초과되었습니다. 프로세스 트리가 종료되었습니다
nb: godkjent sudo utførelse ble tidsavbrutt; prosesstreet ble avsluttet
pl: zatwierdzony Upłynął limit czasu wykonania sudo; drzewo procesów zostało zakończone
pt_br: A execução aprovada do sudo atingiu o tempo limite; a árvore de processos foi encerrada
ru: время ожидания одобренного выполнения sudo истекло; дерево процессов было прекращено
th: การดำเนินการ sudo ที่ได้รับการอนุมัติหมดเวลา; แผนผังกระบวนการถูกยกเลิก
tr: onaylı sudo yürütme zaman aşımına uğradı; süreç ağacı sonlandırıldı
uk: час очікування схваленого виконання sudo минув; дерево процесів було припинено
zh_hans: 批准的sudo执行超时；进程树被终止
zh_hant: 經批准的sudo執行逾時；進程樹被終止

# sudo.error.authentication_failed
source: sudo could not authenticate: Touch ID was cancelled or unavailable
ar: تعذر على sudo المصادقة: تم إلغاء Touch ID أو عدم توفره
bs: sudo nije mogao potvrditi autentičnost: Touch ID je otkazan ili nedostupan
da: sudo kunne ikke godkende: Touch ID blev annulleret eller ikke tilgængelig
de: sudo konnte nicht authentifiziert werden: Touch-ID wurde storniert oder ist nicht verfügbar
es: sudo no pudo autenticarse: Touch ID fue cancelado o no estuvo disponible
fr: sudo n'a pas pu s'authentifier : Touch ID a été annulé ou indisponible
it: sudo non ha potuto eseguire l'autenticazione: Touch ID è stato annullato o non disponibile
ja: sudo を認証できませんでした：Touch ID がキャンセルされたか、利用できません
ko: sudo는 인증할 수 없습니다. Touch ID는 취소되었거나 사용할 수 없습니다.
nb: sudo kunne ikke autentisere: Touch ID ble kansellert eller utilgjengelig
pl: sudo nie mógł uwierzytelnić: Touch ID został anulowany lub niedostępny
pt_br: Não foi possível autenticar o sudo: o Touch ID foi cancelado ou está indisponível
ru: sudo не удалось аутентифицировать: Touch ID был отменен или недоступен.
th: sudo ไม่สามารถตรวจสอบสิทธิ์ได้: Touch ID ถูกยกเลิกหรือไม่พร้อมใช้งาน
tr: sudo kimliği doğrulanamadı: Touch ID iptal edildi veya kullanılamıyor
uk: sudo не вдалося автентифікувати: Touch ID скасовано або недоступний
zh_hans: sudo 无法验证：Touch ID 已取消或不可用
zh_hant: sudo 無法驗證：Touch ID 已取消或不可用
